Catalogs/ВидыВозвратаВОборотИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыВозвратаВОборотИСМП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыПервичныхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПервичныхДокументовИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыВозвратаВОборотИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Доступные виды первичных документов.
// 
// Параметры:
//  ВидВозврата - СправочникСсылка.ВидыВозвратаВОборотИСМП
// 
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.ВидыПервичныхДокументовИСМП - Доступные виды первичных документов
Функция ДоступныеВидыПервичныхДокументов(ВидВозврата) Экспорт
	
	ДоступныеВидыПервичныхДокументов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоступныеВидыПервичныхДокументов.ВидДокумента
		|ИЗ
		|	Справочник.ВидыВозвратаВОборотИСМП.ДоступныеВидыПервичныхДокументов КАК
		|		ДоступныеВидыПервичныхДокументов
		|ГДЕ
		|	ДоступныеВидыПервичныхДокументов.Ссылка = &ВидВозврата";
	
	Запрос.УстановитьПараметр("ВидВозврата", ВидВозврата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеВидыПервичныхДокументов.Добавить(Выборка.ВидДокумента);
	КонецЦикла;
	
	Возврат ДоступныеВидыПервичныхДокументов;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Идентификатор");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.Справочники.ВидыВозвратаВОборотИСМП.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьВидыВозвратовВОборотИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьВидыВозвратовВОборотИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления)

	Идентификаторы          = ПараметрыЗагрузки.Идентификаторы;
	ДанныеКЗагрузке         = ДанныеКлассификатора.ВидыВозвратовВОборот;
	ИмяТаблицы              = Метаданные.Справочники.ВидыВозвратаВОборотИСМП.ПолноеИмя();
	КонфликтыОбновления     = ПараметрыЗагрузки.КонфликтыОбновления;
	
    ДанныеДляПодбора = Новый ТаблицаЗначений;
	ДанныеДляПодбора.Колонки.Добавить("Имя",           ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));

    Для каждого СтрокаКЗагрузке Из ДанныеКЗагрузке Цикл
		ЗаполнитьЗначенияСвойств(ДанныеДляПодбора.Добавить(), СтрокаКЗагрузке);
	КонецЦикла;
    
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Имя КАК Наименование,
		|	ДанныеДляПодбора.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втДанныеДляПодбора
		|ИЗ
		|	&ДанныеДляПодбора КАК ДанныеДляПодбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ВидыВозвратаВОборотИСМП.Ссылка КАК СсылкаПоИдентификатору,
		|	ВидыВозвратаВОборотИСМП.ХешСумма КАК ХешСумма,
		|	ВидыВозвратаВОборотИСМП.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоИдентификатору
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВозвратаВОборотИСМП КАК ВидыВозвратаВОборотИСМП
		|		ПО (ВидыВозвратаВОборотИСМП.Идентификатор = втДанныеДляПодбора.Идентификатор)
		|ГДЕ
		|	втДанныеДляПодбора.Идентификатор <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыВозвратаВОборотИСМП.Ссылка КАК СсылкаПоКлючевымПолям,
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ВидыВозвратаВОборотИСМП.ХешСумма КАК ХешСумма,
		|	ВидыВозвратаВОборотИСМП.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоКлючевымПолям
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВозвратаВОборотИСМП КАК ВидыВозвратаВОборотИСМП
		|		ПО втДанныеДляПодбора.Наименование = ВидыВозвратаВОборотИСМП.Имя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатыПодбораПоКлючевымПолям.Наименование КАК Наименование,
		|	втРезультатыПодбораПоКлючевымПолям.Идентификатор КАК Идентификатор,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(втРезультатыПодбораПоКлючевымПолям.СсылкаПоКлючевымПолям, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору
		|	КОНЕЦ КАК СуществующийОбъектСсылка,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСумма
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСумма
		|	КОНЕЦ КАК ХешСумма,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСуммаПоставляемыхДанных
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСуммаПоставляемыхДанных
		|	КОНЕЦ КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	втРезультатыПодбораПоКлючевымПолям КАК втРезультатыПодбораПоКлючевымПолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатыПодбораПоИдентификатору КАК втРезультатыПодбораПоИдентификатору
		|		ПО втРезультатыПодбораПоКлючевымПолям.Идентификатор = втРезультатыПодбораПоИдентификатору.Идентификатор
		|			И втРезультатыПодбораПоКлючевымПолям.Наименование = втРезультатыПодбораПоИдентификатору.Наименование";
	Запрос.УстановитьПараметр("ДанныеДляПодбора", ДанныеДляПодбора);
	
	ПодобранныеДанные = Запрос.Выполнить().Выгрузить();
	  
    Для каждого СтрокаДанных Из ДанныеКЗагрузке Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Идентификатор", СтрокаДанных.Идентификатор);
		СтруктураПоиска.Вставить("Наименование",  СтрокаДанных.Имя);
		
		НайденныеСтроки = ПодобранныеДанные.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() Тогда
			СтрокаПодобранныхДанных = НайденныеСтроки[0];
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтрокаИдентификатора = Идентификаторы.Добавить();
		СтрокаИдентификатора.ИмяТаблицы    = ИмяТаблицы;
		СтрокаИдентификатора.Идентификатор = СтрокаДанных.Идентификатор;
		СтрокаИдентификатора.Наименование  = СтрокаДанных.Имя;
		
		Если ПараметрыЗагрузки.ЗагрузкаИзменений И СтрокаДанных.Свойство("Модифицирован") Тогда
			Если Не СтрокаДанных.Модифицирован Тогда
				СтрокаИдентификатора.Ссылка = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
				
		ДальнейшиеДействия = ОбщегоНазначенияИС.ПараметрыОбновленияЭлементовПриЗагрузкеКлассификатора(ПараметрыЗагрузки,
			СтрокаПодобранныхДанных.СуществующийОбъектСсылка, СтрокаПодобранныхДанных.ХешСумма,
			СтрокаПодобранныхДанных.ХешСуммаПоставляемыхДанных, СтрокаДанных.ХешСуммаПоставляемыхДанных);
		
		Если ДальнейшиеДействия.КоллизияИзменений Тогда
			ТекстКоллизии = СтрШаблон(НСтр(
				"ru = 'Невозможно загрузить изменения. Элемент справочника ""%1"" с идентификатором ""%2"" был изменен ранее'"),
				ИмяТаблицы, СтрокаДанных.Идентификатор);
			ВызватьИсключение ТекстКоллизии;
		КонецЕсли;
		
		Если ДальнейшиеДействия.СоздатьЭлемент Тогда
			СуществующийОбъект = СоздатьЭлемент();
		ИначеЕсли ДальнейшиеДействия.ТребуетсяОбновление Тогда
			СуществующийОбъект = СтрокаПодобранныхДанных.СуществующийОбъектСсылка.ПолучитьОбъект();
		Иначе
			СтрокаИдентификатора.Ссылка = СтрокаПодобранныхДанных.СуществующийОбъектСсылка;
		КонецЕсли;
		
		Если ДальнейшиеДействия.ЗафиксироватьКонфликт Тогда
			ОбщегоНазначенияИС.ДобавитьЭлементДляЗаписиКонфликтаПриОбновлении(
				КонфликтыОбновления, СтрокаПодобранныхДанных.СуществующийОбъектСсылка, СтрокаДанных);
		КонецЕсли;

        Если ДальнейшиеДействия.ТребуетсяОбновление Или ДальнейшиеДействия.СоздатьЭлемент Тогда
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, СтрокаДанных, , "Идентификатор,ХешСуммаПоставляемыхДанных");

			Если Не ЗначениеЗаполнено(СуществующийОбъект.Идентификатор) Тогда
				СуществующийОбъект.Идентификатор = СтрокаДанных.Идентификатор;
			КонецЕсли;

            Если Метаданные.Перечисления.СтатусыКлассификаторовВидовПродукцииИС.ЗначенияПеречисления.Найти(
				СтрокаДанных.Статус) <> Неопределено Тогда
				СуществующийОбъект.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС[СтрокаДанных.Статус];
            КонецЕсли;
            
			СуществующийОбъект.ДоступныеВидыПервичныхДокументов.Очистить();
			
			Для Каждого ВидДокументаНаименование Из СтрокаДанных.ДоступныеВидыПервичныхДокументов Цикл
				Если ЗначениеЗаполнено(ВидДокументаНаименование) Тогда
					Если Метаданные.Перечисления.ВидыПервичныхДокументовИСМП.ЗначенияПеречисления.Найти(
						ВидДокументаНаименование) <> Неопределено Тогда
						СтрокаСоставаКМ = СуществующийОбъект.ДоступныеВидыПервичныхДокументов.Добавить();
						СтрокаСоставаКМ.ВидДокумента = Перечисления.ВидыПервичныхДокументовИСМП[ВидДокументаНаименование];
					Иначе
						Если ПараметрыЗагрузки.РежимОтладки Тогда
							ВызватьИсключение НСтр("ru = 'Внутренняя ошибка поиска вида первичных документов ИСМП'");
						Иначе
							РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			СуществующийОбъект.ХешСумма = СтрокаДанных.ХешСуммаПоставляемыхДанных;

			Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
            	СуществующийОбъект.ХешСуммаПоставляемыхДанных = СтрокаДанных.ХешСуммаПоставляемыхДанных;
			КонецЕсли;
			            
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СуществующийОбъект);

			СтрокаИдентификатора.Ссылка = СуществующийОбъект.Ссылка;

		КонецЕсли;
		
	КонецЦикла;
	
	Если ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
		ИдентификаторыПоТипу = Идентификаторы.Скопировать(Новый Структура("ИмяТаблицы", ИмяТаблицы), "Наименование,Идентификатор");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИдентификаторов.Наименование КАК Наименование,
		|	ТаблицаИдентификаторов.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВтИдентификаторы
		|ИЗ
		|	&ТаблицаИдентификаторов КАК ТаблицаИдентификаторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыВозвратаВОборотИСМП.Ссылка КАК Ссылка,
		|	ВидыВозвратаВОборотИСМП.Идентификатор КАК Идентификатор,
		|	ВидыВозвратаВОборотИСМП.Имя КАК Наименование
		|ИЗ
		|	Справочник.ВидыВозвратаВОборотИСМП КАК ВидыВозвратаВОборотИСМП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтИдентификаторы КАК ВтИдентификаторы
		|		ПО ВидыВозвратаВОборотИСМП.Идентификатор = ВтИдентификаторы.Идентификатор
		|			И ВидыВозвратаВОборотИСМП.Имя = ВтИдентификаторы.Наименование
		|ГДЕ
		|	ВтИдентификаторы.Наименование ЕСТЬ NULL
		|	И ВтИдентификаторы.Идентификатор ЕСТЬ NULL";
		Запрос.УстановитьПараметр("ТаблицаИдентификаторов", ИдентификаторыПоТипу);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаИдентификатора = Идентификаторы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, ВыборкаДетальныеЗаписи);
			
			СтрокаИдентификатора.ИмяТаблицы = ИмяТаблицы;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт

    СтруктураДанныхОбновления = Новый Структура;

	СтруктураДанныхОбновления.Вставить("Наименование",                     "");
	СтруктураДанныхОбновления.Вставить("Имя",                              "");
	СтруктураДанныхОбновления.Вставить("Описание",                         "");
	СтруктураДанныхОбновления.Вставить("Идентификатор",                    "");
	СтруктураДанныхОбновления.Вставить("Статус",                           "");
	СтруктураДанныхОбновления.Вставить("ДоступныеВидыПервичныхДокументов", Новый Массив);
	СтруктураДанныхОбновления.Вставить("ХешСуммаПоставляемыхДанных",       "");	

	Возврат СтруктураДанныхОбновления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
